<a href="https://colab.research.google.com/github/naveen63hdh/Data-Analytics/blob/main/Assignment.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# 1.Creating Dataframe in Python


> In python there are more than ways to create a dataframe using pandas. We can create dataframe from lists, tuple, dictionary, numpy array, csv file and etc. We can also create an empty dataframe and add records to it.

> To create a dataframe we are loading pandas library in the alias pd, and we are also loading numpy in alias np to create dataframe from numpy array.

In [1]:
import numpy as np
import pandas as pd

## 1.1 Creating empty dataframe and adding records


> DataFrame constructor is used to create a empty dataframe. The columns attribute is a list of strings which become columns of the dataframe. DataFrame rows are reference loc method with index value.

In [2]:
df = pd.DataFrame(columns = ["Emp No","Emp Name","Salary"])

In [3]:
df.loc[0] = [101,"Jai",14000]
df.loc[1] = [102,"Kannan",10000]
df.loc[2] = [103,"Raman",7000]
df.loc[3] = [104,"Suresh",9000]
df.loc[4] = [105,"Sam",11000]

In [4]:
df

  Emp No Emp Name Salary
0    101      Jai  14000
1    102   Kannan  10000
2    103    Raman   7000
3    104   Suresh   9000
4    105      Sam  11000

## 1.2 Creating dataframe using numpy array

> In DataFrame constructor we can pass numpy array. Each row in  numpy array is the corresponding row required in the dataframe.

In [5]:
data = np.array([[101,"Jai",14000],
                 [102,"Kannan",10000],
                 [103,"Raman",7000],
                 [104,"Suresh",9000],
                 [105,"Sam",11000]
                ])

In [6]:
type(data)

numpy.ndarray

In [7]:
df = pd.DataFrame(data,columns = ["Emp No","Emp Name","Salary"])

In [8]:
df

  Emp No Emp Name Salary
0    101      Jai  14000
1    102   Kannan  10000
2    103    Raman   7000
3    104   Suresh   9000
4    105      Sam  11000

## 1.3 Creating dataframe using List

>  To Create a dataframe using list we have to pass the list in DataFrame constructor and we can give column names in colum attribute.

In [9]:
data = [[101,"Jai",14000],
        [102,"Kannan",10000],
        [103,"Raman",7000],
        [104,"Suresh",9000],
        [105,"Sam",11000]]

In [10]:
type(data)

list

In [11]:
df = pd.DataFrame(data,columns = ["Emp No","Emp Name","Salary"])

In [12]:
df

   Emp No Emp Name  Salary
0     101      Jai   14000
1     102   Kannan   10000
2     103    Raman    7000
3     104   Suresh    9000
4     105      Sam   11000

## 1.4 Creating dataframe using Dictionary 

> There are 3 ways to create a dataframe using dictonary 

* [Using Dictionary in DataFrame Constructor](https://colab.research.google.com/drive/1XbRrMi3RkTKGM0l4m1qsXH5LRggqSzrj#scrollTo=BlQdFRMOOwp3)
* [Using List of Dictionary](https://colab.research.google.com/drive/1XbRrMi3RkTKGM0l4m1qsXH5LRggqSzrj#scrollTo=_L6MDM4LOwp1&line=7&uniqifier=1)
* [Using from_dict method](https://colab.research.google.com/drive/1XbRrMi3RkTKGM0l4m1qsXH5LRggqSzrj#scrollTo=_L6MDM4LOwp1&line=7&uniqifier=1)

### 1.4.1 Using Dictionary in DataFrame Constructor


> If we pass dictionary in dataframe then dictionary keys become column names of dataframe and dictionary value becomes dataframe row values. Dictionary column are combined into single row according to the order of dictionary.

In [13]:
data = {'Emp No':[101,102,103,104,105],
        'Emp Name':['Jai','Kannan','Raman','Suresh','Sam'],
        'Salary':[14000,10000,7000,9000,11000]}

In [14]:
type(data)

dict

In [15]:
df = pd.DataFrame(data)

In [16]:
df

   Emp No Emp Name  Salary
0     101      Jai   14000
1     102   Kannan   10000
2     103    Raman    7000
3     104   Suresh    9000
4     105      Sam   11000

### 1.4.2 Using List of Dictionary

> We can pass a list of dictionaries in DataFrame constructor. Each dictionary is considered as a record. Dictionary Keys become Column names in the dataframe. Dictionary values become the row values.

In [17]:
data = [{"Emp No":101,"Emp Name":"Jai","Salary":14000},
        {"Emp No":102,"Emp Name":"Kannan","Salary":10000},
        {"Emp No":103,"Emp Name":"Raman","Salary":7000},
        {"Emp No":104,"Emp Name":"Suresh","Salary":9000},
        {"Emp No":105,"Emp Name":"Sam","Salary":11000}]

In [18]:
type(data)

list

In [19]:
df = pd.DataFrame(data)

In [20]:
df

   Emp No Emp Name  Salary
0     101      Jai   14000
1     102   Kannan   10000
2     103    Raman    7000
3     104   Suresh    9000
4     105      Sam   11000

###  1.4.3 Using from_dict method

> Using **from_dict** is similar to first method except here we can specify whether the keys value should be a column  name or row index. 

> By default keys are identified as column names but we can change it by using **orient** attribute if  we give **index** to orient attribute it will change orientation of dataframe and passes the keys as row index. 

> If we  give orient as index then we can specify column name using columns attribute where we pass column name as list.

In [21]:
data = {'Emp No':[101,102,103,104,105],
        'Emp Name':['Jai','Kannan','Raman','Suresh','Sam'],
        'Salary':[14000,10000,7000,9000,11000]}

In [22]:
type(data)

dict

In [23]:
df = pd.DataFrame().from_dict(data,orient="index",columns=['Emp1','Emp2','Emp3','Emp4','Emp5'])

In [24]:
df

           Emp1    Emp2   Emp3    Emp4   Emp5
Emp No      101     102    103     104    105
Emp Name    Jai  Kannan  Raman  Suresh    Sam
Salary    14000   10000   7000    9000  11000

## 1.5 Creating copy of dataframe

> In some scenarios me might need to do operations in dataframe without affecting the actual dataframe. In those situations we can use copy method and create a clone of the dataframe and work on it.

In [25]:
df1 = df.copy()

In [26]:
df1

           Emp1    Emp2   Emp3    Emp4   Emp5
Emp No      101     102    103     104    105
Emp Name    Jai  Kannan  Raman  Suresh    Sam
Salary    14000   10000   7000    9000  11000

---
# 2. Creating DataFrame from CSV and Saving it to CSV

> CSV(Comma Seperated Values) is the most commonly used format used for storing tabular data like spreadsheets and database. As name suggests in csv values are seperated or delimited by comma ( , )

> Pandas Provide methods for creating dataframe from a csv file and to export/save a dataframe into a csv file.

In [27]:
import pandas as pd

## 2.1 Creating DataFrame from CSV

> To create dataframe from csv pandas library provides a method called read_csv. read_csv method contains many attributes some of the most commonly used attributes are.


1.   **filepath_or_buffer** - URL/Dir location of the csv file goes here
2.   **sep** - Delimeter of csv file. Default value is ','
3.   **header** - Makes the passed row or rowas as column header
4.   **index_col** - Makes passed column as index
5.   **use_cols** - Used to retrive only specific columns

In [28]:
df_path = 'https://raw.githubusercontent.com/naveen63hdh/Data-Analytics/main/dataset.csv'

In [29]:
one_piece_df = pd.read_csv(df_path,sep = ',', header = 'infer', index_col = 'Character', usecols = ['Character','Devil Fruit','Class','Status'])

In [30]:
one_piece_df.head()

                       Devil Fruit      Class       Status
Character
Marshall D. Teach  Gura Gura no Mi  Paramecia     Consumed
Marshall D. Teach  Yami Yami no Mi      Logia     Consumed
Absalom            Suke Suke no Mi  Paramecia  Re-Consumed
Alpacaman             Alpaca SMILE      SMILE     Consumed
Alvida             Sube Sube no Mi  Paramecia     Consumed

## 2.2 Saving DataFrame as CSV
> To save a dataframe as a csv file pandas provide a method called to_csv()

In [31]:
data = {'Emp No':[101,102,103,104,105],
        'Emp Name':['Jai','Kannan','Raman','Suresh','Sam'],
        'Salary':[14000,10000,7000,9000,11000]}

In [32]:
df = pd.DataFrame(data)

In [33]:
df.to_csv('my_dataset.csv')

---
# 3. Group by operations in DataFrame
    
> Pandas groupby() allows us to split our data into separate groups to perform computations for better analysis. groupby() returns the **DataFrameGroupBy** object.

> Using DataFrameGroupBy object we can do some analysis like getting speicfic group's values, number of groups, size of each group and etc.

> Some of the attributes and methods used to access DataFrameGroupBy are:

*   **ngroups** - Attribute to get number of groups
*   **groups** - Attribute that returns groupwise row number                
*   **size()** - Method to display group sizes
*   **first() and last()** - Methods to preview first and last entry of each group
*   **get_group()** - Method to retrive a dataframe for specific group

In [34]:
import pandas as pd

In [35]:
df_path = 'https://raw.githubusercontent.com/naveen63hdh/Data-Analytics/main/dataset.csv'

In [36]:
op_df = pd.read_csv(df_path)

In [37]:
devil_fruits = op_df.groupby('Class')

### 3.1 ngroups - Attribute to get number of **groups**

In [38]:
devil_fruits.ngroups

6

### 3.2 groups - Attribute that returns groupwise row number

In [39]:
devil_fruits.groups

{'(undetermined)': [96, 105, 163], 'Failed SMILE': [78, 98, 141, 150, 164], 'Logia': [1, 22, 28, 30, 50, 63, 104, 120, 135, 139, 140, 155], 'Paramecia': [0, 2, 4, 5, 7, 8, 9, 10, 13, 14, 15, 17, 18, 19, 23, 24, 25, 29, 31, 34, 35, 36, 37, 38, 39, 40, 41, 42, 43, 44, 45, 46, 54, 55, 57, 58, 60, 62, 65, 66, 68, 70, 71, 73, 75, 79, 85, 86, 89, 90, 94, 95, 97, 99, 102, 107, 109, 111, 112, 114, 121, 123, 126, 132, 133, 142, 143, 146, 147, 149, 151, 152, 153, 160, 161, 162, 166, 167, 168, 169, 170, 171, 172, 173, 178], 'SMILE': [3, 6, 11, 12, 26, 47, 48, 49, 51, 56, 61, 69, 72, 74, 76, 77, 80, 81, 82, 83, 84, 101, 108, 110, 124, 125, 129, 137, 144, 148, 156, 157, 158, 159, 174, 175, 176], 'Zoan': [16, 20, 21, 27, 32, 33, 52, 53, 59, 64, 67, 87, 88, 91, 92, 93, 100, 103, 106, 113, 115, 116, 117, 118, 119, 122, 127, 128, 130, 131, 134, 136, 138, 145, 154, 165, 177]}

### 3.3 size() - Method to display group sizes

In [40]:
devil_fruits.size()

Class
(undetermined)     3
Failed SMILE       5
Logia             12
Paramecia         85
SMILE             37
Zoan              37
dtype: int64

### 3.4 first() and last() - Methods to preview first and last entry of each group

In [41]:
devil_fruits.first()

                        Character  ...    Status
Class                              ...
(undetermined)             Karasu  ...  Consumed
Failed SMILE                  Han  ...  Consumed
Logia           Marshall D. Teach  ...  Consumed
Paramecia       Marshall D. Teach  ...  Consumed
SMILE                   Alpacaman  ...  Consumed
Zoan                         Bian  ...  Consumed

[6 rows x 5 columns]

In [42]:
devil_fruits.last()

                                   Character  ...    Status
Class                                         ...
(undetermined)                        Tamago  ...  Consumed
Failed SMILE                            Toko  ...  Consumed
Logia                                 Smoker  ...  Consumed
Paramecia                               Zala  ...  Consumed
SMILE           Wolf gifter (chapter 943) #2  ...  Consumed
Zoan                                 X Drake  ...  Consumed

[6 rows x 5 columns]

### 3.5 get_group() - Method to retrive a dataframe for specific group

In [43]:
devil_fruits.get_group('Logia')

             Character      Devil Fruit       Subclass Awakened       Status
1    Marshall D. Teach  Yami Yami no Mi  Regular Logia       No     Consumed
22           Borsalino  Pika Pika no Mi  Regular Logia       No     Consumed
28        Caesar Clown  Gasu Gasu no Mi  Regular Logia       No     Consumed
30             Caribou  Numa Numa no Mi  Regular Logia       No     Consumed
50           Crocodile  Suna Suna no Mi  Regular Logia       No     Consumed
63                Enel  Goro Goro no Mi  Regular Logia       No     Consumed
104              Kuzan    Hie Hie no Mi  Regular Logia       No     Consumed
120              Monet  Yuki Yuki no Mi  Regular Logia       No         Free
135     Portgas D. Ace  Mera Mera no Mi  Regular Logia       No  Re-Consumed
139               Sabo  Mera Mera no Mi  Regular Logia       No     Consumed
140           Sakazuki  Magu Magu no Mi  Regular Logia       No     Consumed
155             Smoker  Moku Moku no Mi  Regular Logia       No     Consumed

---
# 4. Combining and Merging in DataFrame

> Pandas Support both Horizontal and vertical combination of dataframes. **Horizontal combination** means combining dataframes in column level **merge()** and **join()** are the methods provided by pandas for horizontal combination.And **Vertical combination** means combining dataframes in row leve **concat()** and **append()** are the methods used for vertical combination.

In [44]:
import pandas as pd

## 4.1 merge() - Combining data on common columns or indices.


> Merging two dataset can be done in two ways

*   Merging dataframe with common column name
*   Merging dataframe with different column name

> Using how attribute in merge() each type can do 4 merge different operations 

*   Inner/Equi Join
*   Left Join
*   Right Join
*   Outer Join

### 4.1.1Merging dataframe with common column name

In [45]:
data1 = {'Emp No':[101,102,103,104,105],
        'Emp Name':['Jai','Kannan','Raman','Suresh','Sam'],
        'Salary':[14000,10000,7000,9000,11000]}                

data2 = {'Emp No':[101,102,104,105,106,107],
        'Team id':[201,203,201,202,202,204],
        'Team Leader':['Vivek','Gaurav','Vivek','Vishwa','Vishwa','Guru']}

In [46]:
df1 = pd.DataFrame(data1)
df2 = pd.DataFrame(data2)

In [47]:
df1

   Emp No Emp Name  Salary
0     101      Jai   14000
1     102   Kannan   10000
2     103    Raman    7000
3     104   Suresh    9000
4     105      Sam   11000

In [48]:
df2

   Emp No  Team id Team Leader
0     101      201       Vivek
1     102      203      Gaurav
2     104      201       Vivek
3     105      202      Vishwa
4     106      202      Vishwa
5     107      204        Guru

### Inner/Equi Join

In [49]:
pd.merge(df1,df2)

   Emp No Emp Name  Salary  Team id Team Leader
0     101      Jai   14000      201       Vivek
1     102   Kannan   10000      203      Gaurav
2     104   Suresh    9000      201       Vivek
3     105      Sam   11000      202      Vishwa

In [50]:
pd.merge(df1,df2,how='inner')

   Emp No Emp Name  Salary  Team id Team Leader
0     101      Jai   14000      201       Vivek
1     102   Kannan   10000      203      Gaurav
2     104   Suresh    9000      201       Vivek
3     105      Sam   11000      202      Vishwa

### Left Join

In [51]:
pd.merge(df1,df2,how='left')

   Emp No Emp Name  Salary  Team id Team Leader
0     101      Jai   14000    201.0       Vivek
1     102   Kannan   10000    203.0      Gaurav
2     103    Raman    7000      NaN         NaN
3     104   Suresh    9000    201.0       Vivek
4     105      Sam   11000    202.0      Vishwa

### Right Join

In [52]:
pd.merge(df1,df2,how='right')

   Emp No Emp Name   Salary  Team id Team Leader
0     101      Jai  14000.0      201       Vivek
1     102   Kannan  10000.0      203      Gaurav
2     104   Suresh   9000.0      201       Vivek
3     105      Sam  11000.0      202      Vishwa
4     106      NaN      NaN      202      Vishwa
5     107      NaN      NaN      204        Guru

### Outer Join

In [53]:
pd.merge(df1,df2,how='outer')

   Emp No Emp Name   Salary  Team id Team Leader
0     101      Jai  14000.0    201.0       Vivek
1     102   Kannan  10000.0    203.0      Gaurav
2     103    Raman   7000.0      NaN         NaN
3     104   Suresh   9000.0    201.0       Vivek
4     105      Sam  11000.0    202.0      Vishwa
5     106      NaN      NaN    202.0      Vishwa
6     107      NaN      NaN    204.0        Guru

### 4.1.2 Merging dataframe with different column name

In [54]:
data1 = {'Emp No':[101,102,103,104,105],
        'Emp Name':['Jai','Kannan','Raman','Suresh','Sam'],
        'Salary':[14000,10000,7000,9000,11000]
        }                

data2 = {'Emp Id':[101,102,104,105,106,107],
        'Team id':[201,203,201,202,202,204],
        'Team Leader':['Vivek','Gaurav','Vivek','Vishwa','Vishwa','Guru']
        }

In [55]:
df1 = pd.DataFrame(data1)
df2 = pd.DataFrame(data2)

In [56]:
df1

   Emp No Emp Name  Salary
0     101      Jai   14000
1     102   Kannan   10000
2     103    Raman    7000
3     104   Suresh    9000
4     105      Sam   11000

In [57]:
df2

   Emp Id  Team id Team Leader
0     101      201       Vivek
1     102      203      Gaurav
2     104      201       Vivek
3     105      202      Vishwa
4     106      202      Vishwa
5     107      204        Guru

In [58]:
pd.merge(df1,df2,left_on = 'Emp No',right_on = 'Emp Id',how = 'inner')

   Emp No Emp Name  Salary  Emp Id  Team id Team Leader
0     101      Jai   14000     101      201       Vivek
1     102   Kannan   10000     102      203      Gaurav
2     104   Suresh    9000     104      201       Vivek
3     105      Sam   11000     105      202      Vishwa

## 4.2 join() - combines data on a key column or an index.

>   join() is similar to merge() both are used to combine dataframe. In join() dataframes can be combined using index but whereas in merge we can combine using both index and columns

In [59]:
data1 = {'Emp No':[101,102,103,104,105],
        'Emp Name':['Jai','Kannan','Raman','Suresh','Sam'],
        'Salary':[14000,10000,7000,9000,11000]}                

data2 = {'Emp No':[101,102,104,105,106,107],
        'Team id':[201,203,201,202,202,204],
        'Team Leader':['Vivek','Gaurav','Vivek','Vishwa','Vishwa','Guru']}

In [60]:
df1 = pd.DataFrame(data1)
df2 = pd.DataFrame(data2)

In [61]:
df1

   Emp No Emp Name  Salary
0     101      Jai   14000
1     102   Kannan   10000
2     103    Raman    7000
3     104   Suresh    9000
4     105      Sam   11000

In [62]:
df2

   Emp No  Team id Team Leader
0     101      201       Vivek
1     102      203      Gaurav
2     104      201       Vivek
3     105      202      Vishwa
4     106      202      Vishwa
5     107      204        Guru

In [63]:
df1.join(df2,lsuffix = '_l',rsuffix = '_r')

   Emp No_l Emp Name  Salary  Emp No_r  Team id Team Leader
0       101      Jai   14000       101      201       Vivek
1       102   Kannan   10000       102      203      Gaurav
2       103    Raman    7000       104      201       Vivek
3       104   Suresh    9000       105      202      Vishwa
4       105      Sam   11000       106      202      Vishwa

## 4.3 concat() - combines Data Frames across rows or columns.


> In concat we pass the list of dataframes that need to be concatinated. Concat operation can be done in two ways


*   Concat dataframe on axis 0 (Default Operation)
*   Concat dataframe on axis 1 (Horizontal Operation)

In [64]:
data1 = {'Emp No':[101,102,103,104,105],
        'Emp Name':['Jai','Kannan','Raman','Suresh','Sam'],
        'Salary':[14000,10000,7000,9000,11000]}                

data2 = {'Emp No':[101,102,104,105,106,107],
        'Team id':[201,203,201,202,202,204],
        'Team Leader':['Vivek','Gaurav','Vivek','Vishwa','Vishwa','Guru']}

In [65]:
df1 = pd.DataFrame(data1)
df2 = pd.DataFrame(data2)

In [66]:
df1

   Emp No Emp Name  Salary
0     101      Jai   14000
1     102   Kannan   10000
2     103    Raman    7000
3     104   Suresh    9000
4     105      Sam   11000

In [67]:
df2

   Emp No  Team id Team Leader
0     101      201       Vivek
1     102      203      Gaurav
2     104      201       Vivek
3     105      202      Vishwa
4     106      202      Vishwa
5     107      204        Guru

### 4.3.1 Concat dataframe on axis 0


> This is the default concat operation with concats list of dataframe into single dataframe

In [68]:
pd.concat([df1,df2])

   Emp No Emp Name   Salary  Team id Team Leader
0     101      Jai  14000.0      NaN         NaN
1     102   Kannan  10000.0      NaN         NaN
2     103    Raman   7000.0      NaN         NaN
3     104   Suresh   9000.0      NaN         NaN
4     105      Sam  11000.0      NaN         NaN
0     101      NaN      NaN    201.0       Vivek
1     102      NaN      NaN    203.0      Gaurav
2     104      NaN      NaN    201.0       Vivek
3     105      NaN      NaN    202.0      Vishwa
4     106      NaN      NaN    202.0      Vishwa
5     107      NaN      NaN    204.0        Guru

### 4.3.2 Concat dataframe on axis 1


> Concating dataframe with axis 1 is similar to joins

In [69]:
pd.concat([df1,df2],axis = 1)

   Emp No Emp Name   Salary  Emp No  Team id Team Leader
0   101.0      Jai  14000.0     101      201       Vivek
1   102.0   Kannan  10000.0     102      203      Gaurav
2   103.0    Raman   7000.0     104      201       Vivek
3   104.0   Suresh   9000.0     105      202      Vishwa
4   105.0      Sam  11000.0     106      202      Vishwa
5     NaN      NaN      NaN     107      204        Guru

---
# 5.Types of Indexing in DataFrame


> Selecting values from particular rows and columns in a dataframe is known as Indexing. By using Indexing, we can select all rows and some columns or some rows and all columns. 

> Indexing in DataFrame can be done in 3 ways:

*   Column Name
*   loc()
*   iloc()

In [70]:
import pandas as pd 

data = {'Emp No':[101,102,103,104,105],
        'Emp Name':['Jai','Kannan','Raman','Suresh','Sam'],
        'Salary':[14000,10000,7000,9000,11000]}                

df = pd.DataFrame(data)
df

   Emp No Emp Name  Salary
0     101      Jai   14000
1     102   Kannan   10000
2     103    Raman    7000
3     104   Suresh    9000
4     105      Sam   11000

## 5.1 Indexing using column name


> Giving column name in the index part will return only datas from given column.For indexing more than one column, column name can be passed as list.

In [71]:
df['Emp No']

0    101
1    102
2    103
3    104
4    105
Name: Emp No, dtype: int64

In [72]:
df[['Emp No','Salary']]

   Emp No  Salary
0     101   14000
1     102   10000
2     103    7000
3     104    9000
4     105   11000

## 5.2 loc method

> Using loc() we can index row, column or both with the Label (column/row name)

In [73]:
df.loc[[0,1,2],['Emp No','Salary']]

   Emp No  Salary
0     101   14000
1     102   10000
2     103    7000

## 5.3 iloc method

> iloc is similar to loc method but in iloc we use integers to index

In [74]:
df.iloc[:3,1:3]

  Emp Name  Salary
0      Jai   14000
1   Kannan   10000
2    Raman    7000

---
# 6. Aggregation functions in dataframe

> Pandas provides some aggregate functions to do some operations on grouped dataframe.

> Some commonly used aggregation functions are

*   **count()** - returns total number of items in dataframe
*   **sum()** - returns sum of all items
*   **mean()** - returns mean of all items
*   **min()** - returns minimum
*   **max()** - returns maximum

In [75]:
import pandas as pd 

df_path = 'https://raw.githubusercontent.com/naveen63hdh/Data-Analytics/main/bounty.csv'

df = pd.read_csv(df_path)
df.head()

       Character      Bounty         Status
0         Albion  92000000.0            NaN
1         Alvida   5000000.0      Retracted
2         Arlong  20000000.0      Retracted
3  Avalo Pizarro         NaN  Unknown value
4           Babe   3200000.0            NaN

## 6.1 count() - returns total number of items in dataframe

In [76]:
df.groupby('Status').count()

                       Character  Bounty
Status
As Nyaban Brothers             2       2
Over                           4       4
Retracted                     22      22
Unknown value                 18       0
Wanted by Coast Guard          1       1
                              1       1

## 6.2 sum() - returns sum of all items

In [77]:
df.groupby('Status').sum()

                             Bounty
Status
As Nyaban Brothers     1.400000e+07
Over                   1.982000e+08
Retracted              1.259286e+10
Unknown value          0.000000e+00
Wanted by Coast Guard  7.800000e+06
                      1.000000e+06

## 6.3 mean() - returns mean of all items

In [78]:
df.groupby('Status').mean()

                             Bounty
Status
As Nyaban Brothers     7.000000e+06
Over                   4.955000e+07
Retracted              5.724027e+08
Unknown value                   NaN
Wanted by Coast Guard  7.800000e+06
                      1.000000e+06

## 6.4 min() - returns minimum

In [79]:
df.groupby('Status').min()

                                                        Character      Bounty
Status
As Nyaban Brothers                                          Buchi   7000000.0
Over                                                        Doc Q  20000000.0
Retracted              (pirate defeated by Smoker in chapter 439)   5000000.0
Unknown value                                       Avalo Pizarro         NaN
Wanted by Coast Guard                                 Curly Dadan   7800000.0
                                                      Mikio Itoo   1000000.0

## 6.5 max() - returns maximum

In [80]:
df.groupby('Status').max()

                         Character        Bounty
Status
As Nyaban Brothers            Sham  7.000000e+06
Over                     Van Augur  7.200000e+07
Retracted                   Trebol  5.564800e+09
Unknown value                Yorki           NaN
Wanted by Coast Guard  Curly Dadan  7.800000e+06
                       Mikio Itoo  1.000000e+06



---


# 7 Appending rows and columns to dataframe


> In Pandas appending rows and columns to a dataframe can be done in many number of ways some of them are:

*   By using append()
*   By appending rows using loc[] method.
*   By appending colums using lists.

In [81]:
import pandas as pd

## 7.1 By using append()

> By using append() we can append both rows and columns from one dataframe to another. The 3 types of appending using append() are:


*   With same index as dataframes
*   By ignoring index
*   With Different Shapes

In [82]:
data1 = {'Emp No':[101,102,103,104,105],
        'Emp Name':['Jai','Kannan','Raman','Suresh','Sam'],
        'Salary':[14000,10000,7000,9000,11000]}                

df1 = pd.DataFrame(data1)
df1

   Emp No Emp Name  Salary
0     101      Jai   14000
1     102   Kannan   10000
2     103    Raman    7000
3     104   Suresh    9000
4     105      Sam   11000

### 7.1.1 With same index as dataframes

In [83]:
data2 = {
        'Emp No':[201,202,203,204],
        'Emp Name':['Vivek','Gaurav','Vishwa','Guru'],
        'Salary':[10000,13000,15000,12000]
         }

df2 = pd.DataFrame(data2)
df1.append(df2)

   Emp No Emp Name  Salary
0     101      Jai   14000
1     102   Kannan   10000
2     103    Raman    7000
3     104   Suresh    9000
4     105      Sam   11000
0     201    Vivek   10000
1     202   Gaurav   13000
2     203   Vishwa   15000
3     204     Guru   12000

### 7.1.2 By ignoring index

In [84]:
data2 = {
        'Emp No':[201,202,203,204],
        'Emp Name':['Vivek','Gaurav','Vishwa','Guru'],
        'Salary':[10000,13000,15000,12000]
         }

df2 = pd.DataFrame(data2)
df1.append(df2,ignore_index=True)

   Emp No Emp Name  Salary
0     101      Jai   14000
1     102   Kannan   10000
2     103    Raman    7000
3     104   Suresh    9000
4     105      Sam   11000
5     201    Vivek   10000
6     202   Gaurav   13000
7     203   Vishwa   15000
8     204     Guru   12000

### 7.1.3 With Different Shapes

In [85]:
data2 = {'Emp No':[101,102,104,105,106,107],        
        'Team Leader':['Vivek','Gaurav','Vivek','Vishwa','Vishwa','Guru']}
df2 = pd.DataFrame(data2)
df1.append(df2,ignore_index = True)

    Emp No Emp Name   Salary Team Leader
0      101      Jai  14000.0         NaN
1      102   Kannan  10000.0         NaN
2      103    Raman   7000.0         NaN
3      104   Suresh   9000.0         NaN
4      105      Sam  11000.0         NaN
5      101      NaN      NaN       Vivek
6      102      NaN      NaN      Gaurav
7      104      NaN      NaN       Vivek
8      105      NaN      NaN      Vishwa
9      106      NaN      NaN      Vishwa
10     107      NaN      NaN        Guru

## 7.2 By appending rows using loc[] method

> Create an empty DataFrame with a column name and indices and then appending rows one by one to it using loc[] method.

In [86]:
df1 = pd.DataFrame(columns=["Emp Name","Salary"],index=[101,102,103,104,105])
df1

    Emp Name Salary
101      NaN    NaN
102      NaN    NaN
103      NaN    NaN
104      NaN    NaN
105      NaN    NaN

In [87]:
df1.loc[101] = ['Jai',14000]
df1.loc[102] = ['Kannan',10000]
df1.loc[103] = ['Raman',7000]
df1.loc[104] = ['Suresh',9000]
df1.loc[105] = ['Sam',11000]
df1

    Emp Name Salary
101      Jai  14000
102   Kannan  10000
103    Raman   7000
104   Suresh   9000
105      Sam  11000

## 7.3 By appending colums using lists

In [88]:
data1 = {'Emp No':[101,102,103,104,105],        
        'Salary':[14000,10000,7000,9000,11000]}                

df1 = pd.DataFrame(data1)
df1

   Emp No  Salary
0     101   14000
1     102   10000
2     103    7000
3     104    9000
4     105   11000

In [89]:
empname = ['Jai','Kannan','Raman','Suresh','Sam']
df1['Emp Name'] = empname
df1

   Emp No  Salary Emp Name
0     101   14000      Jai
1     102   10000   Kannan
2     103    7000    Raman
3     104    9000   Suresh
4     105   11000      Sam

---
# 8 Pivoting operations in dataframe


> Pivoting dataframes reshaping datframes. In some scenario we might need to have column values as column name or index in those scenarios pivotting comes into the picture. Panda provides two methods for pivotting

*   pivot() - Returns ReshapedDataFrame
*   pivot_table() - Returns DataFrame

In [90]:
import pandas as pd
data = {'Emp No':[101,102,103,104,105],
        'Emp Name':['Jai','Kannan','Raman','Suresh','Sam'],
        'Salary':[14000,10000,7000,9000,11000]}                

df = pd.DataFrame(data)
df

   Emp No Emp Name  Salary
0     101      Jai   14000
1     102   Kannan   10000
2     103    Raman    7000
3     104   Suresh    9000
4     105      Sam   11000

## 8.1 pivot()

> pivot() is an extremely powerfull function that can be used to reshape dataframe based on colums values. pivot() is called using DataFrame object and it returns ReshapedDataFrame object. pivot() contains three parameters they are:

*   **index** - Single/List of columns to make new frame's index
*   **columns** - Single/List of columns to make new frame's column
*   **values** - Sinlge/List of columns to populate new frame

**Syntax :**
```
pivot(index,columns,values)
```

In [91]:
df.pivot(index ='Emp No',columns = 'Emp Name',values = 'Salary' )

Emp Name      Jai   Kannan   Raman      Sam  Suresh
Emp No
101       14000.0      NaN     NaN      NaN     NaN
102           NaN  10000.0     NaN      NaN     NaN
103           NaN      NaN  7000.0      NaN     NaN
104           NaN      NaN     NaN      NaN  9000.0
105           NaN      NaN     NaN  11000.0     NaN

## 8.2 pivot_table()

> Like pivot() pivot_table() is also used to reshape dataframe but pivot_table returns DataFrame which look like excel style pivot table. And pivot_table is called using pandas object. pivot_table provides many parameter some of the important params are:


*   **data** - DataFrame object which holds data
*   **index** - Single/List of columns to make new frame's index
*   **columns** - Single/List of columns to make new frame's column
*   **values** - Sinlge/List of columns to populate new frame

**Syntax :**
```
pivot_table(data,index,columns,values)
```

In [92]:
df2 = pd.pivot_table(data = df,index = 'Emp Name',columns = 'Emp No',values ='Salary')
df2

Emp No        101      102     103     104      105
Emp Name
Jai       14000.0      NaN     NaN     NaN      NaN
Kannan        NaN  10000.0     NaN     NaN      NaN
Raman         NaN      NaN  7000.0     NaN      NaN
Sam           NaN      NaN     NaN     NaN  11000.0
Suresh        NaN      NaN     NaN  9000.0      NaN

In [93]:
type(df2)

pandas.core.frame.DataFrame

---
# 9. Different possible operations to a DataFrame

> Pandas provides rich set of methods to work with DataFrames. All the methods we discussed above is just a small part. There are more methods which are useful for dataframe operations some of them are:

*   transpose()
*   sample()
*   replace()
*   fillna()
*   describe()

In [94]:
import pandas as pd

## 9.1 transpose()

> As name suggests transpose() is used to convert dataframe's index to column and columns to index. Using this we can get the transpose matrix of dataframe.

In [95]:
data = {'Emp No':[101,102,103,104,105],
        'Emp Name':['Jai','Kannan','Raman','Suresh','Sam'],
        'Salary':[14000,10000,7000,9000,11000]}                

df = pd.DataFrame(data)
df

   Emp No Emp Name  Salary
0     101      Jai   14000
1     102   Kannan   10000
2     103    Raman    7000
3     104   Suresh    9000
4     105      Sam   11000

In [96]:
df.transpose()

              0       1      2       3      4
Emp No      101     102    103     104    105
Emp Name    Jai  Kannan  Raman  Suresh    Sam
Salary    14000   10000   7000    9000  11000

## 9.2 sample()

> In some scenarios we might need some random which doesn't have any common pattern using sample() we can achieve that sample() retrives some random datas from dataframe. Using n attribute of sample() we can say how many number of random data needs to be retrived.

In [97]:
df_path = 'https://raw.githubusercontent.com/naveen63hdh/Data-Analytics/main/dataset.csv'

one_piece = pd.read_csv(df_path)
one_piece

                        Character  ...       Status
0               Marshall D. Teach  ...     Consumed
1               Marshall D. Teach  ...     Consumed
2                         Absalom  ...  Re-Consumed
3                       Alpacaman  ...     Consumed
4                          Alvida  ...     Consumed
..                            ...  ...          ...
174     Wolf gifter (chapter 809)  ...     Consumed
175  Wolf gifter (chapter 943) #1  ...     Consumed
176  Wolf gifter (chapter 943) #2  ...     Consumed
177                       X Drake  ...     Consumed
178                          Zala  ...     Consumed

[179 rows x 6 columns]

In [98]:
one_piece.sample(n=5)

        Character                          Devil Fruit  ... Awakened       Status
2         Absalom                      Suke Suke no Mi  ...       No  Re-Consumed
136         Queen  Ryu Ryu no Mi, Model: Brachiosaurus  ...       No     Consumed
31         Carmel                      Soru Soru no Mi  ...       No  Re-Consumed
142  Sanjuan Wolf                            (unnamed)  ...       No     Consumed
95        Kanjuro                            (unnamed)  ...       No     Consumed

[5 rows x 6 columns]

## 9.3 replace()

> replace() is used to replace string, dictionaries, list, series and even regex. The value(s) or the regex expression to be replaced will be given in *to_replace* attribute and the string. The new value is given in *value* attribute. If we are using regex expression then *regex* attribute should be flagged as True.

In [99]:
data = {'Emp No':[101,102,103,104,105],
        'Emp Name':['Jai','Kannan','Raman','Suresh','Sam'],
        'Salary':[14000,10000,7000,9000,10000]}                

df = pd.DataFrame(data)
df

   Emp No Emp Name  Salary
0     101      Jai   14000
1     102   Kannan   10000
2     103    Raman    7000
3     104   Suresh    9000
4     105      Sam   10000

In [100]:
df.replace(10000,12000)

   Emp No Emp Name  Salary
0     101      Jai   14000
1     102   Kannan   12000
2     103    Raman    7000
3     104   Suresh    9000
4     105      Sam   12000

In [101]:
df.replace('Ka.+','Ramu',regex=True)

   Emp No Emp Name  Salary
0     101      Jai   14000
1     102     Ramu   10000
2     103    Raman    7000
3     104   Suresh    9000
4     105      Sam   10000

## 9.4 fillna()

> fillna() is used to fill the null/NaN values with custom values in the dataframe. *value* attribute is used to give the custom null value.

In [102]:
data = {'Emp No':[101,102,103,104,105],
        'Emp Name':['Jai','Kannan','Raman','Suresh','Sam'],
        'Salary':[14000,None,7000,None,10000]}                

df = pd.DataFrame(data)
df

   Emp No Emp Name   Salary
0     101      Jai  14000.0
1     102   Kannan      NaN
2     103    Raman   7000.0
3     104   Suresh      NaN
4     105      Sam  10000.0

In [103]:
df.fillna(0)

   Emp No Emp Name   Salary
0     101      Jai  14000.0
1     102   Kannan      0.0
2     103    Raman   7000.0
3     104   Suresh      0.0
4     105      Sam  10000.0

## 9.5 describe()

> Describe method gives a brief summary of datas in dataframe. It gives values for **count, mean, std, min, max, 25%,50% and 75%**. Using include adn exclude attributes we can say the datatupes that need to be included and excluded.

In [104]:
data = {'Emp No':[101,102,103,104,105],
        'Emp Name':['Jai','Kannan','Raman','Suresh','Sam'],
        'Salary':[14000.0,10000.0,7000.0,9000.0,10000.0]}                

df = pd.DataFrame(data)
df

   Emp No Emp Name   Salary
0     101      Jai  14000.0
1     102   Kannan  10000.0
2     103    Raman   7000.0
3     104   Suresh   9000.0
4     105      Sam  10000.0

In [105]:
df.describe(include=float)

             Salary
count      5.000000
mean   10000.000000
std     2549.509757
min     7000.000000
25%     9000.000000
50%    10000.000000
75%    10000.000000
max    14000.000000